//==============================================================================
//
// メッシュフィールドの描画〔meshfield.h〕
// AUTHOR : MARE HORIAI
//
//==============================================================================
#pragma once
#ifndef _MESHFIELD_H_
#define _MESHFIELD_H_
#include "main.h"

//==============================================================================
// プロトタイプ宣言
//==============================================================================
HRESULT InitMeshfield(void);	// 3Dポリゴンの初期化処理
void UninitMeshfield(void);		// 3Dポリゴンの終了処理
void UpdateMeshfield(void);		// 3Dポリゴンの更新処理
void DrawMeshfield(void);		// 3Dポリゴンの描画処理

#endif
